//{{JOBNAME}} JOB ({{ACCOUNT}}),
//             CLASS={{JOBCLASS}}{{TYPERUNPARM}}
/*JOBPARM SYSAFF={{SYSAFF}}
//* Comments
//STEP1    EXEC PGM=IEBGENER
//SYSIN    DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD *
Hello, world!
/*
//SYSUT2   DD SYSOUT=*
//STEP1    EXEC PGM=IEBGENER
//SYSIN    DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD *
Hello, world!
/*
//SYSUT2   DD SYSOUT=*
//STEP1    EXEC PGM=IEBGENER
//SYSIN    DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD *
Hello, world!
/*
//SYSUT2   DD SYSOUT=*
//
